remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/lp_clk_cal_regs.h
/* -------- LP_CLK_CAL_REGS_CALIB_STATUS_REG : (LP_CLK_CAL_REGS Offset: 0x0c) (R/ 8) Calibration Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CALIBRATION_OSC_DONE:1;    /**< bit:      0  This is the done flag for calibrating the osc clock */
    uint8_t  CALIBRATION_RTC_DONE:1;    /**< bit:      1  This is the done flag for calibrating the rtc clock */
    uint8_t  :2;                        /**< bit:   2..3  Reserved */
    uint8_t  OSC_CAL_RUNNING:1;         /**< bit:      4  OSC clock calibration in progress        */
    uint8_t  RTC_CAL_RUNNING:1;         /**< bit:      5  RTC clock calibration in progress        */
    uint8_t  :2;                        /**< bit:   6..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} LP_CLK_CAL_REGS_CALIB_STATUS_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_OFFSET 0x0C                                          /**<  (LP_CLK_CAL_REGS_CALIB_STATUS_REG) Calibration Status Register  Offset */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_RESETVALUE 0x00u                                         /**<  (LP_CLK_CAL_REGS_CALIB_STATUS_REG) Calibration Status Register  Reset Value */

#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_OSC_DONE_Pos 0                                              /**< (LP_CLK_CAL_REGS_CALIB_STATUS_REG) This is the done flag for calibrating the osc clock Position */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_OSC_DONE_Msk (0x1u << LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_OSC_DONE_Pos)  /**< (LP_CLK_CAL_REGS_CALIB_STATUS_REG) This is the done flag for calibrating the osc clock Mask */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_OSC_DONE LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_OSC_DONE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_OSC_DONE_Msk instead */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_RTC_DONE_Pos 1                                              /**< (LP_CLK_CAL_REGS_CALIB_STATUS_REG) This is the done flag for calibrating the rtc clock Position */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_RTC_DONE_Msk (0x1u << LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_RTC_DONE_Pos)  /**< (LP_CLK_CAL_REGS_CALIB_STATUS_REG) This is the done flag for calibrating the rtc clock Mask */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_RTC_DONE LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_RTC_DONE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LP_CLK_CAL_REGS_CALIB_STATUS_REG_CALIBRATION_RTC_DONE_Msk instead */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_OSC_CAL_RUNNING_Pos 4                                              /**< (LP_CLK_CAL_REGS_CALIB_STATUS_REG) OSC clock calibration in progress Position */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_OSC_CAL_RUNNING_Msk (0x1u << LP_CLK_CAL_REGS_CALIB_STATUS_REG_OSC_CAL_RUNNING_Pos)  /**< (LP_CLK_CAL_REGS_CALIB_STATUS_REG) OSC clock calibration in progress Mask */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_OSC_CAL_RUNNING LP_CLK_CAL_REGS_CALIB_STATUS_REG_OSC_CAL_RUNNING_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LP_CLK_CAL_REGS_CALIB_STATUS_REG_OSC_CAL_RUNNING_Msk instead */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_RTC_CAL_RUNNING_Pos 5                                              /**< (LP_CLK_CAL_REGS_CALIB_STATUS_REG) RTC clock calibration in progress Position */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_RTC_CAL_RUNNING_Msk (0x1u << LP_CLK_CAL_REGS_CALIB_STATUS_REG_RTC_CAL_RUNNING_Pos)  /**< (LP_CLK_CAL_REGS_CALIB_STATUS_REG) RTC clock calibration in progress Mask */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_RTC_CAL_RUNNING LP_CLK_CAL_REGS_CALIB_STATUS_REG_RTC_CAL_RUNNING_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use LP_CLK_CAL_REGS_CALIB_STATUS_REG_RTC_CAL_RUNNING_Msk instead */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_MASK 0x33u                                          /**< \deprecated (LP_CLK_CAL_REGS_CALIB_STATUS_REG) Register MASK  (Use LP_CLK_CAL_REGS_CALIB_STATUS_REG_Msk instead)  */
#define LP_CLK_CAL_REGS_CALIB_STATUS_REG_Msk 0x33u                                          /**< (LP_CLK_CAL_REGS_CALIB_STATUS_REG) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief LP_CLK_CAL_REGS hardware registers */
typedef struct {  /* Low Power Clock Calibration Registers */
  RwReg16 CONFIG_REG;     /**< (LP_CLK_CAL_REGS Offset: 0x00) Configuration of the calibration clocks and the enable of calibration */
  __I  uint8_t  Reserved1[2];
  RoReg   CALIB_OSC_COUNT_REG; /**< (LP_CLK_CAL_REGS Offset: 0x04) Calibration OSC Count Register (Any write sets bit 15 and clears bit 31) */
  RoReg   CALIB_RTC_COUNT_REG; /**< (LP_CLK_CAL_REGS Offset: 0x08) Calibration RTC Count Register (Any write sets bit 15 and clears bit 31) */
  RoReg8  CALIB_STATUS_REG; /**< (LP_CLK_CAL_REGS Offset: 0x0C) Calibration Status Register */
} LpClkCalRegs;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief LP_CLK_CAL_REGS hardware registers */
typedef struct {  /* Low Power Clock Calibration Registers */
  __IO LP_CLK_CAL_REGS_CONFIG_REG_Type CONFIG_REG;     /**< Offset: 0x00 (R/W  16) Configuration of the calibration clocks and the enable of calibration */
       RoReg8                         Reserved1[0x2];
  __I  LP_CLK_CAL_REGS_CALIB_OSC_COUNT_REG_Type CALIB_OSC_COUNT_REG; /**< Offset: 0x04 (R/   32) Calibration OSC Count Register (Any write sets bit 15 and clears bit 31) */
  __I  LP_CLK_CAL_REGS_CALIB_RTC_COUNT_REG_Type CALIB_RTC_COUNT_REG; /**< Offset: 0x08 (R/   32) Calibration RTC Count Register (Any write sets bit 15 and clears bit 31) */
  __I  LP_CLK_CAL_REGS_CALIB_STATUS_REG_Type CALIB_STATUS_REG; /**< Offset: 0x0C (R/    8) Calibration Status Register */
} LpClkCalRegs;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_LP_CLK_CAL_REGS_COMPONENT_ */
